#include <stdio.h>

int main() {
    int A, B, C, D, E, F, G;
    // A = -2 + 5 * 2  → -2 + 10 = 8 (ทำคูณก่อน)
    A = -2 + 5 * 2;
    printf("A = %d\n", A);
    // B = 10 / 2 * 3  → 5 * 3 = 15 (ทำหารก่อน)
    B = 10 / 2 * 3;
    printf("B = %d\n", B);
    // C = 6 / 2 + 3 * (4 % 2)  → 3 + 3*0 = 3 (ทำหารก่อน)
    C = 6 / 2 + 3 * (4 % 2);
    printf("C = %d\n", C);

    // D = (5 + 2) * 15 % 4  → 7 * 15 = 105, 105 % 4 = 1 (ทำในวงเล็บก่อน แล้วคิดจาก ซ้าย → ขวา )
    D = (5 + 2) * 15 % 4;
    printf("D = %d\n", D);

    // E = 6 + 2 * 2 - 6 / 2  → 6 + 4 - 3 = 7 (ทำคูณก่อน → ทำหาร → แล้วคิดจาก ซ้าย → ขวา )
    E = 6 + 2 * 2 - 6 / 2;
    printf("E = %d\n", E);

    // F = 5 + 3 * 2 - 8 / 4 + (6 % 5) (ทำในวงเล็บ → ทำคูณ → ทำหาร → แล้วคิดจาก ซ้าย → ขวา )
    //     → 5 + 6 - 2 + 1 = 10
    F = 5 + 3 * 2 - 8 / 4 + (6 % 5);
    printf("F = %d\n", F);

    // G = (4 + 3) * 2 - 10 / (2 + 3) (ทำในวงเล็บทั้งสองวงให้เรียบร้อย แล้วคิดจาก ซ้าย → ขวา )
    //     → (7 * 2) - (10 / 5) = 14 - 2 = 12
    G = (4 + 3) * 2 - 10 / (2 + 3);
    printf("G = %d\n", G);
    return 0;
}