 
 #include <stdio.h>

 // --- ส่วนที่ 2: W06-02-02 (ตัวแปรประเภท double) ---
    int main(){
    //เก็บค่าตัวเเปรเป็ฯจุดทศนิยม
   float x = 1.0;
   float y = 2.0;
    float z; // ยังไม่กำหนดค่า

    printf("W06-02-02:\n");
    printf("1. x = %.1f, y = %.1f, z = uninitialized\n", x, y);

    x = y + 5.0; // x = 2.0 + 5.0 = 7.0 (นำค่า y มาบวก 0.5 โดนค่า x จะเปลี่ยนเป็นค่าที่คำนวณได้)
    printf("2. x = %.1f, y = %.1f\n", x, y);

    y = x / 2.0; // y = 7.0 / 2.0 = 3.5 (นำค่า x คำนวณได้จาก บรรทัดที่ 14 มาหาร 2 โดยที่ y จะเปลี่ยนเป็นค่าใหม่)
    printf("3. x = %.1f, y = %.1f\n", x, y);

    y = (x * 3.0) + 4.0; // y = 21.0 + 4.0 = 25.0 (นำค่า x คำนวณได้จาก บรรทัดที่ 14 มาคูณ 3 และ +4 โดยที่ y จะเปลี่ยนเป็นค่าใหม่)
    printf("4. x = %.1f, y = %.1f\n", x, y);

    x = -0.5 - y; // x = -0.5 - 25.0 = -25.5 (นำค่า y ที่ได้จาก บรรทัดที่ 20 มาลบ 0.5 โดยค่า y ต้องติดลบเพราะเครื่องหมายหน้า y )
    printf("5. x = %.1f, y = %.1f\n", x, y);

    z = x + y; // z = -25.5 + 25.0 = -0.5 (เป็นการนำค่า x และ y มาบวกกันเพื่อทราบค่า Z )
    printf("6. x = %.1f, y = %.1f, z = %.1f\n", x, y, z);

    return 0;
}
    