#include <stdio.h>

int main() {
    // --- ส่วนที่ 1: W06-02-01 เก็บค่าตัวแปรเป็นจำนวนเต็ม
    int i = 1;
    int j = 2;
    int k; // ยังไม่กำหนดค่า

    printf("W06-02-01:\n");
    printf("1. i = %d, j = %d, k = uninitialized\n", i, j);

    k = i + j;  // k = 1 + 2 = 3 (เป็นการบวก)
    printf("2. i = %d, j = %d, k = %d\n", i, j, k);

    i = i + (k * 2); // i = 1 + (3 * 2) = 7 (ทำในวงเล็บก่อน แล้วนำมาบวก+2)
    printf("3. i = %d, j = %d, k = %d\n", i, j, k);

    j = i / 2; // j = 7 / 2 = 3 (การหารที่ไม่เอาเศษหรือจุดศนิยมเลย)
    printf("4. i = %d, j = %d, k = %d\n", i, j, k);

    k = i % 2; // k = 7 %% 2 = 1 (การหารที่เอาเศษที่เหลือจากการหาร)
    printf("5. i = %d, j = %d, k = %d\n", i, j, k);

    i = (j + k) * 3; // i = (3 + 1) * 3 = 12 (ทำในวงเล็บก่อน แล้วจึงนำมาคูณ 3)
    printf("6. i = %d, j = %d, k = %d\n\n", i, j, k);

    return 0;
}
/*บรรทัดที่ 13 16 19 22 25 เป็นการนำตัวเลขที่คำนวณได้มาแสดงผลพร้อมเก็บค่าตัวแปรไปเรื่อยๆ*/
    